{
  "author": "Jami At Tirmidhi",
  "hadith": {
    "hadithnumber": 2953,
    "arabicnumber": 2953,
    "text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Al Ala` bin Abdurrahman] dari [Ayahnya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa shalat tanpa membaca ummul Qur'an (Al Fatihah), maka shalatnya kurang, shalatnya kurang, dan tidak sempurna.\" Abu Al Ala` berkata; Aku berkata; \"Hai Abu Hurairah, aku terkadang shalat di belakang imam.\" Abu Hurairah berkata; \"Hai Ibnu Al Farisi, bacalah sendiri, aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah Ta'ala berfirman: Aku membagi shalat antara Aku dan hambaKu menjadi dua bagian, separuhnya untukKu dan separuhnya untuk hambaKu, dan hambaKu berhak mendapat yang ia meminta. Bila seorang hamba membaca ALHAMDULILLAAHI RABBIL 'AALAMIIN, Allah Tabaraka wa Ta'ala berfirman; HambaKu memujiKu. Bila hamba membaca \"ARRAHMAANIRRAHIIM, \" Allah Tabaraka wa Ta'ala berfirman: \"HambaKu memujaku.\" Bila hamba membaca \"MAALIKI YAWMIDDIIN, \" Allah Tabaraka wa Ta'ala berfirman: \"HambaKu mengagungkanKu, dan ini untukKu, antara Aku dan hambaKu; IYYAAKA NA'BUDU WA IYYAAKA NASTA'IIN dan akhir surat untuk hambaKu dan hambaKu berhak mendapatkan yang ia minta, ia membaca: IHDINASH SHIRAATHAL MUSTAQIIM SHIRAATHAL LADZIINA AN'AMTA 'ALAIHIM GHARIL MAGHDLUUBI 'ALAIHIM WALADL DLAALLIIN.\" Abu Isa berkata; Hadits ini hasan. [Syu'bah], [Isma'il bin Ja'far] dan lainnya meriwayatkan dari [Al Ala` bin Abdurrahman] dari [Ayahnya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam seperti hadits ini. [Ibnu Juraij] dan [Malik bin Anas] meriwayatkan dari [Al Ala` bin Abdurrahman] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam seperti ini. Telah mengabarkan kepada kami yang demikian itu [Muhammad bin Yahya] dan [Ya'qub bin Sufyan Al Farisi], keduanya berkata; telah menceritakan kepada kami [Isma'il bin Abu Uwais] dari [Ayahnya] dari [Al Ala` bin Abdurrahman] telah menceritakan kepadaku [Ayahku] dan [Abu As Sa`ib] bekas budak Hisyam bin Zuhrah, keduanya adalah teman Abu Hurairah, dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa shalat tanpa membaca ummul Qur'an (Al Fatihah) maka shalatnya kurang, dan tidak sempurna.\" Tidak disebutkan dalam hadits Isamil bin Abu Uwais lebih dari matan itu, dan aku bertanya kepada Abu Zur'ah tentang hadits ini, ia menjawab; \"Kedua hadits itu shahih.\" Lalu ia berhujah dengan hadits Ibnu Abu Uwais dari Ayahnya dari Al Ala",
    "grades": [
      {
        "name": "Ahmad Muhammad Shakir",
        "grade": "Sahih"
      },
      {
        "name": "Al-Albani",
        "grade": "Sahih"
      },
      {
        "name": "Zubair Ali Zai",
        "grade": "Sahih Muslim"
      }
    ],
    "reference": {
      "book": 47,
      "hadith": 4
    }
  }
}