{
  "author": "Jami At Tirmidhi",
  "hadith": {
    "hadithnumber": 2953,
    "arabicnumber": 2953,
    "text": "Narrated Al-'Ala bin 'Abdur-Rahman:from his father, from Abu Hurairah that the Messenger of Allah (ﷺ) said: \"Whoever performs a Salat in which he does not recite Umm Al-Qur'an in it, then it is aborted, it is aborted, not complete.\" He Said: \"I said: 'O Abu Hurairah! Sometimes I am behind an Imam.' He said: 'O Ibn Al-Farisi! Then recite it to yourself. For indeed I heard the Messenger of Allah (ﷺ) saying: Allah, the Most High said: \"I have divided the Salat between Myself and My slaves into two halves. Half of it is for Me, and half of it for My slave, and My slave shall have what he asks for. My slave stands and says: All praise is due to Allah, the Lord of All that exists.\" So Allah, Blessed is He and Most High says: \"My slave has expressed his gratitude to Me.\" He says: \"The Merciful, the Beneficent. So he says: \"My slave has praised Me.\" He says: Owner of the Day of Reckoning. He says: \"My slave has glorified Me. And this is for Me, and between Me and My slave is: It is You alone whom we worship and it is You alone from whom we seek aid\" until the end of the Surah \"This is for My slave and My slave shall have what he asks for.\" So he says: Guide us to the straight path. The path of those upon whom You have bestowed your favor, not those with whom is Your wrath, now those who are astray.\"' [Abu 'Eisa said:] This Hadith is Hasan. (Other chains of narrations) (Another chain) from Abu Hurairah that the Prophet said: \"Whoever performs a Salat in which he does not recite Umm AlQur'an in it, then it is aborted, [it is aborted,] then it is aborted, not complete.\" And in Ismã'il bin Abi Uwais' Hadith there is no more than this. I asked Abu Zur'ah about this Hadith, he said: \"Both of the Hadith are Sahih.\" And he argued this with the narrations of Ibn Abi Uwais from his father from Al-'Ala",
    "grades": [
      {
        "name": "Ahmad Muhammad Shakir",
        "grade": "Sahih"
      },
      {
        "name": "Al-Albani",
        "grade": "Sahih"
      },
      {
        "name": "Zubair Ali Zai",
        "grade": "Sahih Muslim"
      }
    ],
    "reference": {
      "book": 47,
      "hadith": 4
    }
  }
}